Tekla.Structures.Internal.MessagePump
The message pump.

Tekla.Structures.Internal.MessagePump.currentHandler
Current handler to invoke.

Tekla.Structures.Internal.MessagePump.noHandler
Current handler to invoke.

Tekla.Structures.Internal.MessagePump.lockObject
Lock object to guard currentHandler.

Tekla.Structures.Internal.MessagePump.InitializeForHeadless
Initialize for headless.

Tekla.Structures.Internal.MessagePump.Pump(System.Threading.Tasks.Task)
Pumps messages.
task: Task for to pump messages. Infinite pumping if null.

Tekla.Structures.Internal.MessagePump.Idle(DotNetKit.Synchronize.IdleHandler)
The idle handler.
handler: